<template>
  <div class="single-page single-hero">
    <div class="single-hero-container">
      <div class="single-hero__content">
        <div class="single-hero__top">
          <h3 class="section-title">Навчання з нами - це</h3>
        </div>
        <div class="single-hero-content">
          <div class="single-hero-content__item">
            <ul class="single-hero-list">
              <li
                v-for="(item, index) in items"
                :key="index"
                class="single-hero-list__item"
              >
                {{ item.text }}
              </li>
            </ul>
          </div>
          <div class="controls">
            <AppButton theme="white" size="small" router :to="{ name: 'index' }"
              >Повернутися назад</AppButton
            >
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import AppButton from '@/components/AppButton'
export default {
  name: 'StudyWithUs',
  components: { AppButton },
  layout: 'news',
  data() {
    return {
      items: [
        {
          text:
            'Розвиток самостійності відповідальності та цілеспрямованості учнів;'
        },
        {
          text:
            'Забезпечення якісної дошкільної, початкової та середньої загальної освіти;'
        },
        {
          text: 'Доступ до навчання з будь-якого місця та в будь-який час;'
        },
        {
          text:
            "Уроки та постійний зв'язок із професійними та толерантними вчителями, що викладають предмети за авторською методикою з любов’ю;"
        },
        {
          text:
            'Темп навчання, відповідно до індивідуальних потреб та можливостей учнів, можлиість проходження 2х класів за один рік;'
        },
        {
          text:
            'Можливість обирати поглиблений профіль навчання відповідно до здібностей та вподобань учнів;'
        },
        {
          text: 'Атестат державного зразка, можливість екстернату;'
        },
        {
          text:
            'Майстер-класи та інтерактиви від викладачів провідних вищих навчальних закладів;'
        },
        {
          text:
            'Принцип Long-life education, надання знижок та пріоритет для вступу в Міжрегіональну Академію управління персоналом за 20 спеціальностями та 109 спеціалізаціями. Академія включає Президентський університет (м. Київ), Всеукраїнський університет (понад 40 інститутів, філій, дочірніх структур у всіх регіонах України) та Міжнародний відкритий університет (Інститут міжнародної освіти у м. Києві, мережа центрів відкритої освіти Міжрегіональної Академії управління персоналом за кордоном);'
        },
        {
          text:
            'Участь у шкільних олімпідах та конкурсах Малої академії наук України.'
        }
      ]
    }
  }
}
</script>
